Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: This is an important point to remember: Git resets your working directory to look like the snapshot of the commit that the branch you check out points to.
es: Es importante recordar que Git revierte la carpeta de trabajo exactamente al estado en que estaba en la confirmación (commit) apuntada por la rama que activamos (checkout) en cada momento.

source: When Git packs objects, it looks for files that are named and sized similarly, and stores just the deltas from one version of the file to the next.
es: Cuando Git empaqueta objetos, va buscando archivos de igual nombre y tamaño similar. Almacenando únicamente las diferencias entre una versión de cada archivo y la siguiente.

source: You need to edit the script so that it stops at the commit you want to edit.
es: Para que el script se detenga en cada confirmación de cambios a modificar, hay que editarlo.

source: ## Git Hooks ##
es: ## Puntos de enganche Git ##

source: When that is done, click the "Create Repository" button.
es: Cuando lo hayas escrito, clica sobre el botón "Crear Repositorio" ("Create Repository").

source: You can disable settings by either leaving them out of the setting string or prepending a `-` in front of the value.
es: Puedes desactivarlos tanto dejandolos fuera de la cadena de ajustes, como añadiendo el prefijo '-' delante del valor.

source: This command gives you a diff, but it may be misleading.
es: Este comando te dará las diferencias, pero puede ser engañoso.

source: The next thing you’ll notice is the error message.
es: Lo segundo que se puede apreciar es el mensaje de error:

source: This is the SHA-1 hash — a checksum of the content you’re storing plus a header, which you’ll learn about in a bit.
es: Este checksum hash SHA-1 es una suma de comprobación del contenido que estás guardando más una cabecera; cabecera sobre la que trataremos en breve.

source: This section has covered a number of common workflows for dealing with several very different types of Git projects you’re likely to encounter and introduced a couple of new tools to help you manage this process.
es: En esta sección hemos visto unos cuantos de los flujos de trabajo más habituales para lidiar con distintos tipos de proyectos Git. Y hemos introducido un par de nuevas herramientas para ayudarte a gestionar estos procesos.

source: They’re often used to enforce certain policies, although it’s important to note that these scripts aren’t transferred during a clone.
es: A menudo, se suelen utilizar para obligar a seguir ciertas reglas; aunque es importante indicar que estos script no se transfieren durante el clonado.

source: It’s important to remember when you’re doing all this that these branches are completely local.
es: Es importante recordar que, mientras estás haciendo todo esto, todas las ramas son completamente locales.

source: You can use this to find your blob’s name:
es: Puedes usar esta información para localizar el nombre del objeto binario:

source: Although Git can check to make sure each object still matches its SHA-1 checksum and points to valid objects, it doesn’t do that by default on every push.
es: Aunque Git tiene la capacidad para asegurarse de que cada objeto sigue casando con su suma de control SHA-1 y sigue apuntando a objetos válidos. No lo suele hacer en todos y cada uno de los envios (push).

source: What gets interesting is that you can fairly easily merge changes from one of the branches to the other.
es: Lo que hace interesante este método es la posibilidad que brinda de fusionar cambios de una rama sobre la otra de forma sencilla.

source: If you’ve committed and then you want to change the snapshot you committed by adding or changing files, possibly because you forgot to add a newly created file when you originally committed, the process works basically the same way.
es: Si se desea cambiar la instantánea (snapshot) de archivos en la última confirmación de cambios, habitualmente por haber tenido algún descuido al añadir algún archivo de reciente creación. El proceso a seguir es básicamente el mismo.

source: The only thing left is to enforce fast-forward-only pushes.
es: Lo único que nos queda por implementar es un mecanismo para limitar los envios a envios de avance rápido (Fast-Forward-Only pushes).

source: If you download and install the `exiftool` program, you can use it to convert your images into text about the metadata, so at least the diff will show you a textual representation of any changes that happened:
es: Si te descargas e instalas el programa 'exiftool', puedes utilizarlo para convertir tus imagenes a textos (metadatos), de tal forma que diff podrá al menos mostrarte algo útil de cualquier cambio que se produzca:

source: The contributor pushes to their own public copy.
es: La persona colaboradora envia (push) a su propia copia pública.

source: For example, you can get the same results as in the previous example by typing `git log origin/master..` — Git substitutes HEAD if one side is missing.
es: Por ejemplo, se pueden obtener los mismos resultados tecleando `git log origin/master..`, ya que git sustituye HEAD en la parte faltante.

source: Now your project history has diverged (see Figure 3-9).
es: Ahora el registro de tu proyecto diverge (ver Figura 3-9).

source: It uses the same data-transfer mechanism as the SSH protocol but without the encryption and authentication overhead.
es: Utiliza los mismos mecanismos de transmisión de datos que el protocolo SSH, pero sin la sobrecarga de la encriptación ni de la autentificación.

source: One of the first things you did was set up your name and e-mail address:
es: Una de las primeras acciones que has realizado con Git ha sido el configurar tu nombre y tu dirección de correo-e.

source: In many instances, you’ll have two or three developers with a few commits a day, or possibly less for somewhat dormant projects.
es: En muchas ocasiones, tendrás dos o tres desarrolladores, con tan solo unas pocas confirmaciones de cambios (commits) diarias; e incluso menos en algunos proyectos durmientes.

source: The `commit-msg` hook takes one parameter, which again is the path to a temporary file that contains the current commit message.
es: El punto de enganche 'commit-msg' recibe un parámetro: la ubicación (path) del archivo temporal que contiene el mensaje de confirmación actual.

source: Git can color its output to your terminal, which can help you visually parse the output quickly and easily.
es: Git puede marcar con colores los resultados que muestra en tu terminal, ayudandote así a leerlos más facilmente.

source: I’ll demonstrate how to send a patch via Gmail, which happens to be the e-mail agent I use; you can read detailed instructions for a number of mail programs at the end of the aforementioned `Documentation/SubmittingPatches` file in the Git source code.
es: Voy a indicar cómo enviar un parche usando Gmail, que da la casualidad de que es el agente de correo utilizado por mí. En el final del anteriormente citado documento, `Documentation/SubmittingPatches`, puedes leer instrucciones detalladas para otros agentes de correo.

source: If you have Git version 1.6.2 or later, you can also use the `--track` shorthand:
es: Si tienes la versión 1.6.2 de Git, o superior, puedes utilizar también el parámetro '--track':

source: Now that you have a bare copy of your repository, all you need to do is put it on a server and set up your protocols.
es: Ahora que ya tienes una copia básica de tu repositorio, todo lo que te resta por hacer es colocarlo en un servidor y ajustar los protocolos.

source: This scenario often includes a canonical repository that represents the "official" project.
es: Habitualmente, este escenario suele incluir un repositorio canónico, representante "oficial" del proyecto.

source: ## Summary ##
es: ## Recapitulación ##

source: Most of the time, this command does nothing.
es: La mayor parte de las veces, este comando no hace nada.

source: Type the name of the tool you’d rather use.
es: Tecleando el nombre de dicha herramienta.

source: For security reasons, it is strongly encouraged to have this daemon run as a user with read-only permissions to the repositories – you can easily do this by creating a new user 'git-ro' and running the daemon as them.
es: Por razones de seguridad, es recomendable lanzar este demonio con un usuario que tenga unicamente permisos de lectura en los repositorios --lo puedes hacer creando un nuevo usuario 'git-ro' y lanzando el demonio con él--.

source: If you decide not to use Gitosis, but you want to set up a Git daemon, you’ll have to run this on each project you want the Git daemon to serve:
es: Si decides no utilizar Gitosis, pero sigues queriendo utilizar un demonio Git, has de lanzar este comando en cada proyecto que desees servír vía el demonio Git:

source: You can calculate the SHA-1 value of a string in Ruby by including the SHA1 digest library with the `require` command and then calling `Digest::SHA1.hexdigest()` with the string:
es: En Ruby, para calcular el valor SHA-1 de una cadena de texto: has de incluir la libreria de generación SHA1 con el comando `require` y llamar luego a la orden `Digest::SHA1.hexdigest()`:

source: Insert 18333fig0415.png Figure 4-15.
es: Insert 18333fig0415.png Figura 4-15.

source: When you have a Git repository locally, add GitHub as a remote and push up your master branch:
es: Una vez tengas un repositorio local Git, añadele el sitio GitHub como un remoto y envia (push) allí tu rama principal:

source: It takes the Git repository by itself, without a working directory, and creates a directory specifically for it alone.
es: Se coge el repositorio Git en sí mismo, sin la carpeta de trabajo, y se crea una copia en una nueva carpeta específica para él solo.

source: The difference is how you submit them to the project.
es: La diferencia está en la forma de enviarlos al proyecto.

source: Remote branches act as bookmarks to remind you where the branches on your remote repositories were the last time you connected to them.
es: Las ramas remotas funcionan como marcadores, para recordarte en qué estado se encontraban tus repositorios remotos la última vez que conectaste con ellos.

source: Instead of getting the diff output on the command line, Git fires up P4Merge, which looks something like Figure 7-1.
es: En lugar de mostrar las diferencias por línea de comandos, Git lanzará P4Merge, que tiene una pinta como la de la Figura 7-1.

source: When you save that, you have a single commit that introduces the changes of all three previous commits.
es: Al guardar esto, se tendrá una sola confirmación de cambios que introducirá todos los cambios que estaban en las tres confirmaciones de cambios previamente existentes.

source: Suppose you’re done with a remote branch — say, you and your collaborators are finished with a feature and have merged it into your remote’s `master` branch (or whatever branch your stable codeline is in).
es: Imagina que ya has terminado con una rama remota. Es decir, tanto tu como tus colaboradores habeis completado una determinada funcionalidad y la habeis incorporado (merge) a la rama 'master' en el remoto (o donde quiera que tengais la rama de código estable).

source: You can’t directly compare two versions unless you check them out and scan them manually, right?
es: No puedes comparar directamente dos versiones, a no ser que extraigas ambas y las compares manualmente, ¿no?.

source: This creates a new pointer at the same commit you’re currently on (see Figure 3-4).
es: Esto creará un nuevo apuntador apuntando a la misma confirmación donde estés actualmente (ver Figura 3-4).

source: You can use `git merge -s subtree` and it will work fine; but Git will also merge the histories together, which you probably don’t want.
es: Utilizando el comando `git merge -s subtree`, que funciona correctamente; pero fusionando también los historiales entre sí. Un efecto secundario que posiblemente no interese.

source: This command puts conflict markers in any files it has issues with, much like a conflicted merge or rebase operation.
es: Este comando pondrá marcadores de conflicto en cualquier archivo con problemas, de forma similar a como lo haría una operación de fusión (merge) o de reorganización (rebase).

source: Say you have your repositories in the `/opt/git` directory, and an Apache server is running on your machine.
es: suponiendo que tengas los repositorios en la carpeta '/opt/git', y que hay un servidor Apache en marcha en tu máquina.

source: A remote repository is generally a _bare repository_ — a Git repository that has no working directory.
es: Un repositorio remoto es normalmente un _repositorio básico mínimo_, un repositorio Git sin carpeta de trabajo.

source: This moves HEAD to point to the testing branch (see Figure 3-6).
es: Esto mueve el apuntador HEAD a la rama 'testing' (ver Figura 3-6).

source: First, you basically have to use it if you want authenticated write access to your repository over a network.
es: En primer lugar, necesitas usarlo si quieres un acceso de escritura autentificado a tu repositorio.

source: First, you need to get the Git source code, which GitWeb comes with, and generate the custom CGI script:
es: Primero, necesitas el código fuente de Git, que viene con GitWeb, para generar un script CGI personalizado:

source: First it confirms where you want to save the key (`.ssh/id_rsa`), and then it asks twice for a passphrase, which you can leave empty if you don’t want to type a password when you use the key.
es: Como se vé, este comando primero solicita confirmación de dónde van a a guardarse las claves ('.ssh/id_rsa'), y luego solicita, dos veces, una contraseña (passphrase), contraseña que puedes dejar en blanco si no deseas tener que teclearla cada vez que uses la clave.

source: If you merge in the other branch, instead of having merge conflicts with the database.xml file, you see something like this:
es: Al fusionar con otra rama, en lugar de tener conflictos de fusión con el archivo database.xml, obtendrás algo como:

source: Again, having multiple long-running branches isn’t necessary, but it’s often helpful, especially when you’re dealing with very large or complex projects.
es: Aunque no es obligatorio el trabajar con ramas de larga duración, realmente es práctico y útil. Sobre todo en proyectos largos o complejos.

source: When you commit in Git, Git stores a commit object that contains a pointer to the snapshot of the content you staged, the author and message metadata, and zero or more pointers to the commit or commits that were the direct parents of this commit: zero parents for the first commit, one parent for a normal commit, and multiple parents for a commit that results from a merge of two or more branches.
es: En cada confirmación de cambios (commit), Git almacena un punto de control que conserva: un apuntador a la copia puntual de los contenidos preparados (staged), unos metadatos con el autor y el mensaje explicativo, y uno o varios apuntadores a las confirmaciones (commit) que sean padres directos de esta (un padre en los casos de confirmación normal, y múltiples padres en los casos de estar confirmando una fusión (merge) de dos o mas ramas).

source: Jessica first needs to merge those changes in with her own before she can push to the server.
es: Jessica necesita fusionar (merge) dichos cambios con los suyos antes de poder enviarlos al servidor.

source: Probably the most common transport protocol for Git is SSH.
es: Probablemente, SSH sea el protocolo más habitual para Git.

source: As you initially make commits, you’re given a master branch that points to the last commit you made.
es: Con la primera confirmación de cambios que realicemos, se creará esta rama principal 'master' apuntando a dicha confirmación.

source: Getting in the habit of creating quality commit messages makes using and collaborating with Git a lot easier.
es: Si nos acostumbramos a poner siempre mensajes de calidad en las confirmaciones de cambios, facilitaremos en gran medida el trabajo y la colaboración con Git.

source: Now, each user that does this has to send their public key to you or whoever is administrating the Git server (assuming you’re using an SSH server setup that requires public keys).
es: Tras generarla, cada usuario ha de encargarse de enviar su clave pública a quienquiera que administre el servidor Git (en el caso de que este esté configurado con SSH y así lo requiera).

source: pick f7f3f6d changed my name a bit pick 310154e updated README formatting and added blame pick a5f4a0d added cat-file
es: pick f7f3f6d changed my name a bit pick 310154e updated README formatting and added blame pick a5f4a0d added cat-filepick f7f3f6d changed my name a bit pick 310154e updated README formatting and added blame pick a5f4a0d added cat-file

source: ### Binary Files ###
es: ### Archivos binarios ###

source: Now, you can use the `write-tree` command to write the staging area out to a tree object.
es: Tras esto, puedes usar el comando `write-tree` para escribir el área de preparacón a un objeto tipo árbol.

source: This command shows you any commits in your current branch that aren’t in the `master` branch on your `origin` remote.
es: Este comando muestra las confirmaciones de cambio de la rama activa que no están aún en la rama 'master' del repositorio remoto 'origin'.

source: When you commit, you see something like this:
es: Cuando se realiza una confirmación de cambios, se suele ver algo así como:

source: Start by clicking the "create a new one" link next to Your Repositories on the user dashboard.
es: Puedes empezar clicando sobre el enlace "crear uno nuevo" ("create a new one"), en la zona 'Tus repositorios' ('Your Repositories') del panel de control.

source: It summarizes all the commits in the range you give it; for example, the following gives you a summary of all the commits since your last release, if your last release was named v1.0.1:
es: Este comando resume todas las confirmaciones de cambios (commits) en el rango que le indiques. Por ejemplo, si tu último lanzamiento de versión lo fué de la v1.0.1:

source: The “clean” filter is run when files are staged.
es: El filtro "clean" se usa al almacenar (staged).

source: You’ve covered most of the major ways that you can customize your Git client and server to best fit your workflow and projects.
es: Se han visto las principales vías por donde puedes personalizar tanto tu cliente como tu servidor Git para que se ajusten a tu forma de trabajar y a tus proyectos.

source: ## Git Configuration ##
es: ## Configuración de Git ##

source: Insert 18333fig0308.png Figure 3-8.
es: Insert 18333fig0308.png Figura 3-8.

source: The command to do this is `git archive`:
es: El comando para hacerlo es 'git archive':

source: Let’s re-add the public keys for John, Josie, and Jessica:
es: Por ejemplo, para añadir las claves públicas de John, Josie y Jessica:

source: #### E-mail Workflow Hooks ####
es: #### Puntos en el flujo de trabajo del correo electrónico ####

source: Putting that in your `update` script will reject updates that contain commits that have messages that don’t adhere to your rule.
es: Poniendo esto en tu script 'update', serán rechazadas todas las actualizaciones que contengan cambios con mensajes que no se ajusten a tus reglas.

source: If you don’t, people will hate you, and you’ll be scorned by friends and family.
es: Pero si no la sigues, la gente te odiará y serás despreciado por tus familiares y amigos.

source: If one developer clones, makes changes, and then tries to push their changes while another developer has pushed in the meantime, the server will reject that developer’s changes.
es: Si uno de los desarrolladores clona, hace cambios y luego intenta enviarlos; y otro desarrollador ha enviado otros cambios durante ese tiempo; el servidor rechazará los cambios del segundo desarrollador.

source: Some larger projects also have a `proposed` or `pu` (proposed updates) branch that has integrated branches that may not be ready to go into the `next` or `master` branch.
es: Algunos proyectos muy grandes suelen tener una rama denominada 'propuestas' o 'pu' (proposed updates). Donde suele estar todo aquello integrado desde otras ramas, pero que aún no está listo para ser incorporado a las ramas 'siguiente' o 'master'.

source: However, before you do that, note that if your working directory or staging area has uncommitted changes that conflict with the branch you’re checking out, Git won’t let you switch branches.
es: Pero, antes de poder hacer eso, hemos de tener en cuenta que teniendo cambios aún no confirmados en la carpeta de trabajo o en el área de preparación, Git no nos permitirá saltar a otra rama con la que podríamos tener conflictos.

source: The `bisect` command does a binary search through your commit history to help you identify as quickly as possible which commit introduced an issue.
es: Este comando `bisect` realiza una búsqueda binaria por todo el historial de confirmaciones de cambio, para intentar localizar lo más rápido posible aquella confirmación de cambios en la que se pudieron introducir los problemas.

source: Look back at the example commit history in Figure 6-1.
es: Volviendo sobre la historia de proyecto mostrada en la figura 6-1.

source: That means Gitosis recognized you but shut you out because you’re not trying to do any Git commands.
es: Indicandote que Gitosis te ha reconocido, pero te está hechando debido a que no estás intentando lanzar ningún comando Git.

source: This is really useful.
es: Lo cual es realmente útil.

source: Finally, `git apply` is an "apply all or abort all" model where either everything is applied or nothing is, whereas `patch` can partially apply patchfiles, leaving your working directory in a weird state.
es: Por ultimo, citar que 'git apply' sigue un modelo de "aplicar todo o abortar todo", incorporando todos los cambios o no incorporando ninguno. Mientras que 'patch' puede incorporar cambios parcialmente, dejando tu carpeta de trabajo en un estado inconsistente.

source: ## Contributing to a Project ##
es: ## Contribuyendo a un proyecto ##

source: If they want Git to do that automatically each time they run `git push origin`, they can add a `push` value to their config file:
es: Y, para que se haga de forma automática cada vez que ejecute `git push origin`, puede añadir una entrada `push` a su archivo de configuración:

source: In the simplest terms, a bare repository is the contents of your project’s `.git` directory and nothing else.
es: Básicamente, un repositorio básico mínimo son los contenidos de la carpeta '.git', tal cual, sin nada más.

source: The author information is taken from the e-mail’s `From` and `Date` headers, and the message of the commit is taken from the `Subject` and body (before the patch) of the e-mail.
es: La información sobre el autor o autora la recoge de las cabeceras 'From' (Remitente) y 'Date' (Fecha). Y el mensaje para la confirmación (commit) lo recoge de 'Subject' (Asunto) y del cuerpo del correo electrónico.

source: The HEAD file is a symbolic reference to the branch you’re currently on.
es: El archivo HEAD es una referencia simbólica a la rama donde te encuentras en cada momento.

source: By default, Git doesn’t check for consistency all the objects it receives during a push.
es: Por defecto, Git no suele comprobar la consistencia de todos los objetos que recibe durante un envio (push).

source: Each time you commit or change branches, the reflog is updated.
es: Cada vez que confirmas cambios o cambias de rama, el registro (reflog) es actualizado.

source: I put Chapter 1 of this book into Git, added some text to a paragraph, and saved the document.
es: He puesto el capítulo 1 de este libro en Git, le he añadido algo de texto a un párrafo y he guardado el documento.
